# FilePath Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilePath Properties
FilePath Class See Also
---
The FilePath type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CentralServerPath | The path to the location of the central Revit server or cloud.  (Inherited from ModelPath.) |
| CloudPath | Whether this path represents a path on an Autodesk server such as BIM360.  (Inherited from ModelPath.) |
| Empty | Whether this path is empty  (Inherited from ModelPath.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ModelPath.) |
| Region | The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model.  (Inherited from ModelPath.) |
| ServerPath | Whether this path is a server path (as opposed to a file path or cloud path)  (Inherited from ModelPath.) |

# See Also
FilePath Class
Autodesk.Revit.DB Namespace